const express = require('express');
const router = express.Router();

/* GET home page. */
router.get('/polipv', function(req, res, next) {
    res.render('./pages/fontinfo', {
        title: 'СВЕТОВОЙ КОРОБ ИЗ ПОЛИКАРБОНАТА И ПВХ' ,
        imgURL:'../img/lightTitle/1.png' ,
        ul:["Срок службы — до 5 лет",
            "Яркость — низкая",
            "Глубина — 90мм, 130мм, 180мм",
            "Максимальная длина без стыков — 12м",
            "Минимальная высота без стыков — 2м",
            "Кант профиля на лицевой части — 20мм"
        ],
        inside1:`Отличие поликарбоната в том, что он гораздо длиннее (12м), значительно дешевле, но хуже рассеивает свет и имеет ячеистую структуру, которая просвечивается на лицевую панель`,
        inside2:`Лицевая часть из сотового поликарбоната вставляется в специальный паз из ПВХ. Внутрь лайтбокса устанавливаются светодиоды для подсветки. Светорассеивающий поликарбонат может быть
цветным, либо белого цвета с оклейкой из цветной пленки на которой может быть напечатано
любое изображение, наносимое специальными чернилами, не боящимися погодных условий.`
    });
});
router.get('/metkban', function(req, res, next) {
    res.render('./pages/fontinfo', {
        title: 'СВЕТОВОЙ КОРОБ С МЕТАЛЛИЧЕСКИМ КАРКАСОМ\n' +
            'И БАННЕРНОЙ ТКАНЬЮ НА ЛИЦЕВОЙ ЧАСТИ' ,
        imgURL:'../img/lightTitle/1.png' ,
        ul:["Срок службы — до 5 лет",
            "Яркость — средняя",
            "Оптимальная глубина — 150мм",
            "Максимальная длина без стыков — 50м",
            "Минимальная высота без стыков — 3м",
            "Кант профиля на лицевой части — 30мм"
        ],
        inside1:`Преимущество баннерных коробов — их размер. Благодаря тому, что виниловая баннерная ткань
продается в рулонах, а не в листах, её легко транспортировать. Максимальный размер куска баннера без стыков 50×3м, но это не предел, баннер можно склеить и стык будет не заметен. Лицевую
панель на таком коробе можно поменять, заменив баннерную ткань `,
        inside2:`Для изготовления баннерного короба сваривается металлокаркас из профильной трубы. Боковые
части короба закрываются крышками из оцинкованной стали или алюмокомпозита. На лицевую
сторону натягивается баннерная виниловая ткань. Внутрь устанавливаются светодиодные модули.`
    });
});
router.get('/akpvh', function(req, res, next) {
    res.render('./pages/fontinfo', {
        title: 'СВЕТОВОЙ КОРОБ ИЗ АКРИЛА И ПВХ' ,
        imgURL:'../img/lightTitle/3.png' ,
        ul:["Срок службы — до 10 лет",
            "Яркость —  высокая",
            "Оптимальная высота буквы — до 100 см",
            "Максимальная высота буквы — 3м",
            "Минимальная высота — 5см",
            "Минимальная толщина ножки буквы — 15мм",
            "Глубина буквы — 50-150 мм"
        ],
        inside1:`Наиболее популярный вид световых коробов, поскольку сочетает в себе опрятный вид и соотношение цена/качество. Акрил не боится воды и УФ-излучения`,
        inside2:`Лицевая часть фрезеруется из Акрила и склеивается с боковой частью из ПВХ. Внутрь лайтбокса
устанавливаются светодиоды для подсветки. Светорассеивающий акрил может быть цветным, либо
белого цвета с оклейкой из цветной светорассеивающей пленки, на которой может быть напечатано любое изображение, наносимое специальными чернилами, не боящимися влаги и других погодных условий. Не смотря на то, что корпус короба склеен, его можно разбирать и обслуживать.`
    });
});
router.get('/metkak', function(req, res, next) {
    res.render('./pages/fontinfo', {
        title: 'СВЕТОВОЙ КОРОБ С МЕТАЛЛИЧЕСКИМ КАРКАСОМ\n' +
            'И АКРИЛОМ НА ЛИЦЕВОЙ ЧАСТИ' ,
        imgURL:'../img/lightTitle/4.png' ,
        ul:["Срок службы — до 10 лет",
            "Яркость —  средняя",
            "Глубина — 90мм, 130мм, 180мм",
            "Максимальная длина без стыков — 3м",
            "Минимальная высота без стыков — 2м",
            "Кант профиля на лицевой части — 20мм"
        ],
        inside1:`Световые короба из алюминиевого профиля не дорогие, прочные, с возможностью легкой замены
лицевой панели и обслуживания светотехники, но эти короба могут быть только прямоугольными
и достаточно громоздкие (средняя глубина 130мм). Акрил не боится воды и УФ-излучения.`,
        inside2:`Лицевая часть из акрила вставляется в специальный паз алюминиевого профиля. Внутрь лайтбокса устанавливаются светодиоды для подсветки. Акрил может быть цветным, либо белого цвета с
оклейкой из цветной светорассеивающей пленки, на которой может быть напечатано любое изображение, наносимое специальными чернилами, не боящимися погодных условий. Благодаря
специальной конструкции алюминиевого профиля, короб легко обслуживать и менять лицевые панели без демонтажа короба с фасада.`
    });
});
router.get('/metkpv', function(req, res, next) {
    res.render('./pages/fontinfo', {
        title: 'СВЕТОВОЙ КОРОБ С МЕТАЛЛИЧЕСКИМ КАРКАСОМ\n' +
            'И ПВХ НА ЛИЦЕВОЙ ЧАСТИ' ,
        imgURL:'../img/lightTitle/5.png' ,
        ul:["Срок службы — до 2 лет",
            "Яркость —  средняя",
            "Глубина — 90мм, 130мм, 180мм",
            "Максимальная длина без стыков — 3м",
            "Минимальная высота без стыков — 2м",
            "Кант профиля на лицевой части — 20мм"
        ],
        inside1:`Для уличных вывесок, в связи с ветровыми нагрузками, необходима стальная рама в качестве
силового каркаса. Наиболее популярный вид световых коробов, поскольку сочетает в себе максимально опрятный вид и соотношение цена/качество.`,
        inside2:`Лицевая часть из ПВХ вставляется в специальный паз алюминиевого профиля. Внутрь лайтбокса
устанавливаются светодиоды для подсветки. ПВХ может быть цветным, либо белого цвета с оклейкой из цветной светорассеивающей пленки, на которой может быть напечатано любое изображение, наносимое специальными чернилами, не боящимися погодных условий. Благодаря специальной конструкции алюминиевого профиля, короб легко обслуживать и менять лицевые панели без демонтажа короба с фасада.`
    });
});
router.get('/metsot', function(req, res, next) {
    res.render('./pages/fontinfo', {
        title: 'СВЕТОВОЙ КОРОБ С МЕТАЛЛИЧЕСКИМ КАРКАСОМ\n' +
            'И СОТОВЫМ ПОЛИКАРБОНАТОМ НА ЛИЦЕВОЙ ЧАСТИ' ,
        imgURL:'../img/lightTitle/6.png' ,
        ul:["Срок службы — до 5 лет",
            "Яркость — низкая",
            "Глубина — 90мм, 130мм, 180мм",
            "Максимальная длина без стыков — 12м",
            "Минимальная высота без стыков — 2м",
            "Кант профиля на лицевой части — 20мм"
        ],
        inside1:`Отличие сотового поликарбоната от акрила и полистирола в том, что он гораздо длиннее (12м),
значительно дешевле, но хуже рассеивает свет и имеет ячеистую структуру, которая просвечивается на лицевую панель.`,
        inside2:`Лицевая часть из сотового поликарбоната вставляется в специальный паз алюминиевого профиля.
Внутрь лайтбокса устанавливаются светодиоды для подсветки. Светорассеивающий поликарбонат
может быть цветным, либо белого цвета с оклейкой из цветной светорассеивающей пленки, на
которой может быть напечатано любое изображение, наносимое специальными чернилами, не
боящимися влаги и других погодных условий. Не смотря на то, что корпус короба склеен, его
можно разбирать и обслуживать`
    });
});
router.get('/svetod', function(req, res, next) {
    res.render('./pages/fontinfo', {
        title: 'СВЕТОВОЙ КОРОБ С ОТКРЫТЫМИ СВЕТОДИОДАМИ' ,
        imgURL:'../img/lightTitle/7.png' ,
        ul:["Срок службы — до 10 лет",
            "Яркость —  высокая",
            "Оптимальная глубина — 70 мм",
            "Максимальная длина без стыков — 3м",
            "Минимальная высота без стыков — 2м",
            "Кант профиля на лицевой части — 20мм"
        ],
        inside1:`Главное отличие конструкции от стандартных заключается в том, что светодиодные кластеры размещаются не в нутрии буквы, а на ее лицевой поверхности. Короба с открытыми светодиодами отлично подойдут для рекламы заведений развлекательного типа. Возможно программирование
        различных режимов работы: изменение цвета, нарастание-затухание света и др.`,
        inside2:`Обычно тыльная часть и боковые стороны изготавливаются из ПВХ, которая затем оклеивается
        пленкой Oracal. Лицевая сторона отсутствует, а диоды размещаются внутри корпуса. Дополнительно можно прикрепить блок управления, который будет управлять динамическими эффектами.
        Для перелива цветов устанавливают RGB-светодиоды.`
    });
});
router.get('/alum', function(req, res, next) {
    res.render('./pages/fontinfo', {
        title: 'СВЕТОВОЙ КОРОБ ИЗ АЛЮМОКОМПОЗИТА С ПРОРЕЗКОЙ' ,
        imgURL:'../img/lightTitle/8.png' ,
        ul:["Срок службы — до 10 лет",
            "ЯЯркость — средняя",
            "Глубина — 50-100мм",
            "Максимальная длина без стыков — 5,8м",
            "Минимальная высота без стыков — 1м",
            "Кант профиля на лицевой части — нет",
        ],
        inside1:`Алюмокомпозитный материал сочетает в себе прочность, легкость, удобство обработки, презентабельный вид, надежность. Композитные короба светятся не полностью. Сам материал свет не пропускает, а только в тех местах, где сделано отверстие и подложен изнутри акрил. Благодаря этому,
можно выделить только важные моменты в световом коробе, а не засвечивать все целиком.`,
        inside2:`Алюмокомпозитный материал сочетает в себе прочность, легкость, удобство обработки, презентабельный вид, надежность. Композитные короба светятся не полностью. Сам материал свет не пропускает, а только в тех местах, где сделано отверстие и подложен изнутри акрил. Благодаря этому,
можно выделить только важные моменты в световом коробе, а не засвечивать все целиком.`
    });
});
router.get('/alumprozak', function(req, res, next) {
    res.render('./pages/fontinfo', {
        title: 'СВЕТОВОЙ КОРОБ ИЗ АЛЮМОКОМПОЗИТА\n' +
            'С ИНКРУСТАЦИЕЙ ПРОЗРАЧНОГО АКРИЛА' ,
        imgURL:'../img/lightTitle/9.png' ,
        ul:["Срок службы — до 10 лет",
            "Яркость —  высокая",
            "Глубина — 50-100мм",
            "Максимальная длина без стыков — 5,8м",
            "Минимальная высота без стыков — 1м",
            "Кант профиля на лицевой части — нет"
        ],
        inside1:`Алюмокомпозитный материал сочетает в себе прочность, легкость, удобство обработки, презентабельный вид, надежность. Композитные короба светятся не полностью. Сам материал свет не пропускает, а только в тех местах, где сделано отверстие и подложен изнутри акрил. Благодаря этому,
можно выделить только важные моменты в световом коробе, а не засвечивать все целиком`,
        inside2:`Композит фрезеруется из цельного куска и сгибается по граням. Если необходимо, внутрь вставляется металлокаркас из профильной трубы для жесткости. В места, где прорезаны отверстия в композите, инкрустируется светорассеивающий акрил и цветная пленка. В отличие от композитного
короба с прорезкой — световые элементы выпирают из корпуса и их боковые грани светятся, что
добавляет к лицевой подсветке еще и боковую, которая освещает подложку короба по периметру.`
    });
});

module.exports = router;